poll_app/app/views/home/index.html.erb

                            <span class="badge bg-primary rounded-pill py-2 px-3 fw-bold">
                                <%= poll.votes.count %> 票
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."poll_id" = ?  [["poll_id", 1]]

                            <div class="text-end d-flex flex-column align-items-end">
                                <span class="text-secondary small mb-1"><%= poll.votes.count %> 票</span>
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."poll_id" = ?  [["poll_id", 6]]