poll_app/app/views/home/index.html.erb

                        <span class="badge bg-secondary rounded-pill">
                            <%= poll.votes.count %> 票
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."poll_id" = 1