poll_app/app/controllers/home_controller.rb

  def index
    # 1. アンケート一覧
    @polls = Poll.where(status: '公開中').includes(:user).order(created_at: :desc)

    if params[:search].present?
      @polls = @polls.where("title LIKE ?", "%#{params[:search]}%")
    end

    # 2. 人気ランキング
    # モデルに has_many :votes, through: :choices を書いたことで
    # ここでの .left_joins(:votes) が動作するようになります
    @ranking_polls = Poll.left_joins(:votes)
                         .group(:id)
                         .order('COUNT(votes.id) DESC')
                         .limit(5)
---
SELECT "polls".* FROM "polls" WHERE "polls"."status" = '公開中' AND (title LIKE '%a%') ORDER BY "polls"."created_at" DESC
SELECT "users".* FROM "users" WHERE "users"."id" IN (?, ?)  [["id", 2], ["id", 1]]
SELECT "polls".* FROM "polls" LEFT OUTER JOIN "choices" ON "choices"."poll_id" = "polls"."id" LEFT OUTER JOIN "votes" ON "votes"."choice_id" = "choices"."id" GROUP BY "polls"."id" ORDER BY COUNT(votes.id) DESC LIMIT 5
SELECT COUNT(*) FROM "votes" INNER JOIN "choices" ON "votes"."choice_id" = "choices"."id" WHERE "choices"."poll_id" = 1