poll_app/app/controllers/polls_controller.rb

  def index
      # 「公開中」のアンケートを取得し、作成日時の降順で表示 (通常の一覧)
      @polls = Poll.where(status: '公開中').includes(:user).order(created_at: :desc)
---
SELECT "polls".* FROM "polls" WHERE "polls"."status" = '公開中' ORDER BY "polls"."created_at" DESC

  def create
    # current_user.polls.buildが適切に定義されていると仮定
    @poll = current_user.polls.build(poll_params)
    @poll.status = "公開中" # 初期状態は「公開中」に設定

    if @poll.save
---
INSERT INTO "polls" ("user_id", "title", "status", "options", "created_at", "updated_at") VALUES (1, 'パンご飯', '公開中', '["パン","ごはん"]', '2025-11-17 06:05:02.400093', '2025-11-17 06:05:02.400093') RETURNING "id"

  def create_vote
    # Voteオブジェクトを作成し、現在のユーザーとアンケート、選択肢を紐付ける
    # chosen_optionがChoiceモデルのIDであると仮定
    @vote = @poll.votes.build(user: current_user, chosen_option: params[:chosen_option])

    if @vote.save
---
INSERT INTO "votes" ("user_id", "poll_id", "chosen_option", "created_at", "updated_at") VALUES (1, 1, 'パン', '2025-11-17 06:14:34.103926', '2025-11-17 06:14:34.103926') RETURNING "id"

  def result
    # 【機能要件】投票結果の集計ロジック
    # 選択肢IDごとの投票数を集計 (例: {1 => 10, 2 => 5})
    @results = @poll.votes.group(:chosen_option).count
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."poll_id" = 1