poll_app/app/controllers/polls_controller.rb

  def index
    # ベースクエリ: すべてのアンケートを、関連ユーザー情報込みで作成日時降順に取得
    @polls = Poll.all.includes(:user).order(created_at: :desc)

    # 検索クエリがあれば、タイトルで絞り込みを行う
    if params[:search].present?
      @polls = @polls.where("title LIKE ?", "%#{params[:search]}%")
    end

    # 投票数ランキング (上位5件)
    @ranking_polls = Poll.left_joins(:votes)
                         .group(:id)
                         .order('COUNT(votes.id) DESC')
                         .limit(5)
---
SELECT "polls".* FROM "polls" ORDER BY "polls"."created_at" DESC
SELECT COUNT(*) FROM "votes" INNER JOIN "choices" ON "votes"."choice_id" = "choices"."id" WHERE "choices"."poll_id" = 1

  def show
    # ログイン済みで投票済みの場合は結果ページにリダイレクト
    if logged_in? && Vote.exists?(user: current_user, poll: @poll) # user: current_user を使用
---
SELECT "votes".* FROM "votes" WHERE "votes"."poll_id" = ?  [["poll_id", 5]]
SELECT 1 AS one FROM "votes" WHERE "votes"."user_id" = ? AND "votes"."poll_id" = ? LIMIT ?  [["user_id", 1], ["poll_id", 1], ["LIMIT", 1]]

  def edit
    # 編集時、既存の選択肢が2つ未満なら、2つになるまでビルドする
    (2 - @poll.choices.reject(&:marked_for_destruction?).size).times { @poll.choices.build } # 🚨 修正: 削除予定の選択肢を除外 🚨
---
SELECT "choices".* FROM "choices" WHERE "choices"."poll_id" = 1 AND "choices"."id" = 1 LIMIT 1

  def create
    # current_userと関連付けてアンケートをビルド
    @poll = current_user.polls.build(poll_params)

    if @poll.save
      flash[:success] = "新しいアンケートを作成しました！"
      redirect_to @poll
    else
      # 作成失敗時、選択肢が消えないように2つになるまでビルドし直す
      (2 - @poll.choices.reject(&:marked_for_destruction?).size).times { @poll.choices.build } # 🚨 修正: 削除予定の選択肢を除外 🚨
---
INSERT INTO "polls" ("user_id", "title", "status", "options", "created_at", "updated_at", "description") VALUES (1, 'SNS', 'open', NULL, '2026-01-12 17:01:33.017202', '2026-01-12 17:01:33.017202', 'よく使うのは') RETURNING "id"
SELECT "choices".* FROM "choices" WHERE "choices"."poll_id" = 1 AND "choices"."id" = 1 LIMIT 1

  def create_vote
    # 投票前のログインチェックと選択肢チェック
    unless logged_in?
      flash[:error] = "投票を行うにはログインが必要です。"
      redirect_to login_path and return
    end

    chosen_option_id = params[:chosen_option]
    unless chosen_option_id.present? && @poll.choices.exists?(chosen_option_id)
      flash[:error] = "投票する選択肢を選んでください。"
      redirect_to poll_path(@poll) and return
    end

    # 二重投票チェック (user_idとpoll_idの複合キー制約に基づき、Voteモデルのバリデーションが働くはず)
    if Vote.exists?(user: current_user, poll: @poll)
      flash[:notice] = "すでにこのアンケートに投票済みです。結果を表示します。"
      redirect_to result_poll_path(@poll) and return
    end

    # 🚨 【重要】chosen_option ではなく choice_id を使用 🚨
    @vote = @poll.votes.build(user: current_user, choice_id: chosen_option_id)

    if @vote.save
---
SELECT "choices".* FROM "choices" WHERE "choices"."poll_id" = ?  [["poll_id", 6]]
SELECT 1 AS one FROM "votes" WHERE "votes"."user_id" = 1 AND "votes"."poll_id" IS NULL LIMIT 1
SELECT "choices".* FROM "choices" WHERE "choices"."poll_id" = ?  [["poll_id", 5]]
SELECT "votes".* FROM "votes" WHERE "votes"."poll_id" = ?  [["poll_id", 5]]
INSERT INTO "votes" ("user_id", "poll_id", "chosen_option", "created_at", "updated_at") VALUES (1, 1, 'パン', '2025-11-17 06:14:34.103926', '2025-11-17 06:14:34.103926') RETURNING "id"

  def result
    # 選択肢ごとの投票数をカウント
    # 🚨 【重要】chosen_option ではなく choice_id でグループ化 🚨
    vote_counts_by_id = @poll.votes.group(:choice_id).count
---
SELECT COUNT(*) AS "count_all", "choice_id" AS "choice_id" FROM "votes" WHERE "votes"."poll_id" = ? GROUP BY "choice_id"  [["poll_id", 1]]

  def set_poll
    # 関連付けられたデータも同時に取得 (N+1問題対策)
    @poll = Poll.includes(:choices, :votes, :user).find(params[:id])
---
SELECT "choices".* FROM "choices" WHERE "choices"."poll_id" = ?  [["poll_id", 1]]
SELECT "polls".* FROM "polls" WHERE "polls"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ?  [["id", 1]]
SELECT "votes".* FROM "votes" WHERE "votes"."poll_id" = ?  [["poll_id", 1]]