poll_app/app/controllers/sessions_controller.rb

  def create
    # 1. emailでユーザーを検索
    user = User.find_by(email: params[:email])
---
SELECT "users".* FROM "users" WHERE "users"."email" = 'test@example.com' LIMIT 1