poll_app/app/views/polls/index.html.erb

        <span class="badge bg-success rounded-pill">
          <%= poll.votes.count %> 票
---
SELECT COUNT(*) FROM "votes" WHERE "votes"."poll_id" = 4