poll_app/app/views/polls/result.html.erb

        <%# 🚨 修正: Vote.exists? のチェック方法を current_user と poll を使用するように変更 🚨 %>
        <% if !logged_in? || !Vote.exists?(user: current_user, poll: @poll) %>
---
SELECT "votes".* FROM "votes" WHERE "votes"."poll_id" = ?  [["poll_id", 1]]