poll_app/app/views/polls/show.html.erb

    <div class="poll-choices">
      <% @poll.choices.each do |choice| %>
---
SELECT "choices".* FROM "choices" WHERE "choices"."poll_id" = 1